artillery.yml
config:
    target: "http://localhost:4000"
    phases:
        - duration: 20
          arrivalRate: 1
scenarios:
    - flow:
        - post:
            url: '/login'
            json: 
                login: "admin"
                password: "admin"
            capture:
                json: '$.token'
                as: 'token'
        - get:
            headers:
                authorization: 'Bearer {{token}}'
            url: '/users'